results/results_m5_large/results_m5_large_run3/oltp_read_only_t32/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 108.08 qps: 1751.12 (r/w/o: 1531.87/0.00/219.25) lat (ms,95%): 458.96 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 77.70 qps: 1245.75 (r/w/o: 1090.24/0.00/155.51) lat (ms,95%): 590.56 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 75.80 qps: 1216.50 (r/w/o: 1064.90/0.00/151.60) lat (ms,95%): 601.29 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 76.20 qps: 1220.00 (r/w/o: 1067.60/0.00/152.40) lat (ms,95%): 601.29 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 76.40 qps: 1225.60 (r/w/o: 1072.80/0.00/152.80) lat (ms,95%): 590.56 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 75.80 qps: 1206.40 (r/w/o: 1054.80/0.00/151.60) lat (ms,95%): 612.21 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 32 tps: 72.40 qps: 1149.00 (r/w/o: 1004.20/0.00/144.80) lat (ms,95%): 669.89 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 69.20 qps: 1117.60 (r/w/o: 979.20/0.00/138.40) lat (ms,95%): 682.06 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 32 tps: 76.00 qps: 1218.50 (r/w/o: 1066.50/0.00/152.00) lat (ms,95%): 601.29 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 75.90 qps: 1207.40 (r/w/o: 1055.60/0.00/151.80) lat (ms,95%): 612.21 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 32 tps: 71.20 qps: 1146.30 (r/w/o: 1003.90/0.00/142.40) lat (ms,95%): 634.66 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 32 tps: 74.70 qps: 1187.60 (r/w/o: 1038.30/0.00/149.30) lat (ms,95%): 657.93 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            130564
        write:                           0
        other:                           18652
        total:                           149216
    transactions:                        9326   (77.44 per sec.)
    queries:                             149216 (1238.99 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      77.4372
    time elapsed:                        120.4331s
    total number of events:              9326

Latency (ms):
         min:                                  133.98
         avg:                                  412.77
         max:                                  863.40
         95th percentile:                      612.21
         sum:                              3849506.20

Threads fairness:
    events (avg/stddev):           291.4375/1.58
    execution time (avg/stddev):   120.2971/0.11